#### Data preparation

In [ ]:
import pandas as pd

In [9]:
df1 = pd.DataFrame({
    'ticker': ['AAPL', 'MSFT', 'IBM', 'YHOO', 'GOOG'],
    'open': [426.23, 42.30, 101.65, 35.53, 200.41]
})

In [10]:
df2 = pd.DataFrame({
    'ticker': ['AAPL', 'GOOG', 'NFLX'],
    'close': [427.53, 210.96, 91.86]
}, columns=['ticker', 'close'])

In [11]:
print(df1)

  ticker    open
0   AAPL  426.23
1   MSFT   42.30
2    IBM  101.65
3   YHOO   35.53
4   GOOG  200.41

In [12]:
print(df2)

  ticker   close
0   AAPL  427.53
1   GOOG  210.96
2   NFLX   91.86

In [13]:
df_left = pd.merge(df1, df2, on='ticker', how='left')
print(df_left)

  ticker    open   close
0   AAPL  426.23  427.53
1   MSFT   42.30     NaN
2    IBM  101.65     NaN
3   YHOO   35.53     NaN
4   GOOG  200.41  210.96

In [14]:
df_right=pd.merge(df1, df2, on='ticker', how='right')
print(df_right)

  ticker    open   close
0   AAPL  426.23  427.53
1   GOOG  200.41  210.96
2   NFLX     NaN   91.86

In [15]:
df=pd.concat([df1,df2])
print(df)

  ticker    open   close
0   AAPL  426.23     NaN
1   MSFT   42.30     NaN
2    IBM  101.65     NaN
3   YHOO   35.53     NaN
4   GOOG  200.41     NaN
0   AAPL     NaN  427.53
1   GOOG     NaN  210.96
2   NFLX     NaN   91.86

In [16]:
df_inner=pd.merge(df1, df2, how='inner')
print(df_inner)

  ticker    open   close
0   AAPL  426.23  427.53
1   GOOG  200.41  210.96

In [20]:
df.isnull().sum()

ticker    0
open      3
close     5
dtype: int64

In [21]:
df.shape[0]
df.isnull().sum()

ticker    0
open      3
close     5
dtype: int64

In [23]:
print(df1.min(numeric_only=True))

open    35.53
dtype: float64

In [25]:
df2["ticker"] = pd.to_numeric(df2["ticker"], errors="coerce")
print(df2)

   ticker   close
0     NaN  427.53
1     NaN  210.96
2     NaN   91.86

In [29]:
df1["open"] = df1["open"].astype(str)
print(df1.dtypes)

ticker    object
open      object
dtype: object

In [7]:
df1.loc[[1, 3], 'open'] = 'missing'
df1["open"] = pd.to_numeric(df1["open"], errors="ignore")
print(df1)

  ticker     open
0   AAPL   426.23
1   MSFT  missing
2    IBM   101.65
3   YHOO  missing
4   GOOG   200.41

In [37]:
weather = pd.read_csv('weather.csv')

In [38]:
print(weather.head(3))

        id  year  month element  d1    d2    d3  d4  d5  d6  ...  d22   d23  \
0  MX17004  2010      1    tmax NaN   NaN   NaN NaN NaN NaN  ...  NaN   NaN
1  MX17004  2010      1    tmin NaN   NaN   NaN NaN NaN NaN  ...  NaN   NaN
2  MX17004  2010      2    tmax NaN  27.3  24.1 NaN NaN NaN  ...  NaN  29.9

   d24  d25  d26  d27  d28  d29   d30  d31
0  NaN  NaN  NaN  NaN  NaN  NaN  27.8  NaN
1  NaN  NaN  NaN  NaN  NaN  NaN  14.5  NaN
2  NaN  NaN  NaN  NaN  NaN  NaN   NaN  NaN

[3 rows x 35 columns]

In [39]:
weather_melt = pd.melt(weather,
    id_vars=['id', 'year', 'month', 'element'],
    var_name='day',value_name='temp'
)
weather_melt.head(3)

        id  year  month element day  temp
0  MX17004  2010      1    tmax  d1   NaN
1  MX17004  2010      1    tmin  d1   NaN
2  MX17004  2010      2    tmax  d1   NaN

In [40]:
weather_tidy = weather_melt.pivot_table(
    index=['id', 'year', 'month', 'day'],
    columns='element',
    values='temp'
)
weather_tidy.head(3)

element                 tmax  tmin
id      year month day
MX17004 2010 1     d30  27.8  14.5
             2     d11  29.7  13.4
                   d2   27.3  14.4